ZigEmbeddedGroup/texasinstruments-data/ccs_base/common/targetdb/Modules/msp/mspm0l111x/ADC0_1MSPS_1.0.xml
        <register id="ADC0_DMA_TRIG_MIS" width="32" offset="0x18" description="Masked interrupt status extension">
            <bitfield id="MEMRESIFG0" description="Raw interrupt status for MEMRES0.
This bit is set to 1 when MEMRES0 is loaded with a new
conversion result.
Reading MEMRES0 register will clear this bit, or when the
corresponding bit in ICLR is set to 1" begin="8" end="8" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="No new data ready."/>
                <bitenum id="SET" value="0x1" description="A new data is ready to be read."/>
            </bitfield>
            <bitfield id="MEMRESIFG1" description="Raw interrupt status for MEMRES1.
This bit is set to 1 when MEMRES1 is loaded with a new
conversion result.
Reading MEMRES1 register will clear this bit, or when the
corresponding bit in ICLR is set to 1" begin="9" end="9" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="No new data ready."/>
                <bitenum id="SET" value="0x1" description="A new data is ready to be read."/>
            </bitfield>
            <bitfield id="MEMRESIFG2" description="Raw interrupt status for MEMRES2.
This bit is set to 1 when MEMRES2 is loaded with a new
conversion result.
Reading MEMRES2 register will clear this bit, or when the
corresponding bit in ICLR is set to 1" begin="10" end="10" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="No new data ready."/>
                <bitenum id="SET" value="0x1" description="A new data is ready to be read."/>
            </bitfield>
            <bitfield id="MEMRESIFG3" description="Raw interrupt status for MEMRES3.
This bit is set to 1 when MEMRES3 is loaded with a new
conversion result.
Reading MEMRES3 register will clear this bit, or when the
corresponding bit in ICLR is set to 1" begin="11" end="11" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="No new data ready."/>
                <bitenum id="SET" value="0x1" description="A new data is ready to be read."/>
            </bitfield>
        </register>
        <register id="ADC0_DMA_TRIG_ISET" width="32" offset="0x20" description="Interrupt set extension">
            <bitfield id="MEMRESIFG0" description="Raw interrupt status for MEMRES0.
This bit is set to 1 when MEMRES0 is loaded with a new
conversion result.
Reading MEMRES0 register will clear this bit, or when the
corresponding bit in ICLR is set to 1" begin="8" end="8" width="1" rwaccess="R/W">
                <bitenum id="NO_EFFECT" value="0x0" description="No new data ready."/>
                <bitenum id="SET" value="0x1" description="A new data is ready to be read."/>
            </bitfield>
            <bitfield id="MEMRESIFG1" description="Raw interrupt status for MEMRES1.
This bit is set to 1 when MEMRES1 is loaded with a new
conversion result.
Reading MEMRES1 register will clear this bit, or when the
corresponding bit in ICLR is set to 1" begin="9" end="9" width="1" rwaccess="R/W">
                <bitenum id="NO_EFFECT" value="0x0" description="No new data ready."/>
                <bitenum id="SET" value="0x1" description="A new data is ready to be read."/>
            </bitfield>
            <bitfield id="MEMRESIFG2" description="Raw interrupt status for MEMRES2.
This bit is set to 1 when MEMRES2 is loaded with a new
conversion result.
Reading MEMRES2 register will clear this bit, or when the
corresponding bit in ICLR is set to 1" begin="10" end="10" width="1" rwaccess="R/W">
                <bitenum id="NO_EFFECT" value="0x0" description="No new data ready."/>
                <bitenum id="SET" value="0x1" description="A new data is ready to be read."/>
            </bitfield>
            <bitfield id="MEMRESIFG3" description="Raw interrupt status for MEMRES3.
This bit is set to 1 when MEMRES3 is loaded with a new
conversion result.
Reading MEMRES3 register will clear this bit, or when the
corresponding bit in ICLR is set to 1" begin="11" end="11" width="1" rwaccess="R/W">
                <bitenum id="NO_EFFECT" value="0x0" description="No new data ready."/>
                <bitenum id="SET" value="0x1" description="A new data is ready to be read."/>
            </bitfield>
        </register>
        <register id="ADC0_DMA_TRIG_ICLR" width="32" offset="0x28" description="Interrupt clear extension">
            <bitfield id="MEMRESIFG0" description="Raw interrupt status for MEMRES0.
This bit is set to 1 when MEMRES0 is loaded with a new
conversion result.
Reading MEMRES0 register will clear this bit, or when the
corresponding bit in ICLR is set to 1" begin="8" end="8" width="1" rwaccess="R/W">
                <bitenum id="NO_EFFECT" value="0x0" description="No new data ready."/>
                <bitenum id="CLR" value="0x1" description="A new data is ready to be read."/>
            </bitfield>
            <bitfield id="MEMRESIFG1" description="Raw interrupt status for MEMRES1.
This bit is set to 1 when MEMRES1 is loaded with a new
conversion result.
Reading MEMRES1 register will clear this bit, or when the
corresponding bit in ICLR is set to 1" begin="9" end="9" width="1" rwaccess="R/W">
                <bitenum id="NO_EFFECT" value="0x0" description="No new data ready."/>
                <bitenum id="CLR" value="0x1" description="A new data is ready to be read."/>
            </bitfield>
            <bitfield id="MEMRESIFG2" description="Raw interrupt status for MEMRES2.
This bit is set to 1 when MEMRES2 is loaded with a new
conversion result.
Reading MEMRES2 register will clear this bit, or when the
corresponding bit in ICLR is set to 1" begin="10" end="10" width="1" rwaccess="R/W">
                <bitenum id="NO_EFFECT" value="0x0" description="No new data ready."/>
                <bitenum id="CLR" value="0x1" description="A new data is ready to be read."/>
            </bitfield>
            <bitfield id="MEMRESIFG3" description="Raw interrupt status for MEMRES3.
This bit is set to 1 when MEMRES3 is loaded with a new
conversion result.
Reading MEMRES3 register will clear this bit, or when the
corresponding bit in ICLR is set to 1" begin="11" end="11" width="1" rwaccess="R/W">
                <bitenum id="NO_EFFECT" value="0x0" description="No new data ready."/>
                <bitenum id="CLR" value="0x1" description="A new data is ready to be read."/>
            </bitfield>
        </register>
