ZigEmbeddedGroup/texasinstruments-data/ccs_base/common/targetdb/Modules/msp/mspm0l111x/ADC0_1MSPS_1.0.xml
    <register id="ADC0_SCOMP1" width="32" offset="0x1118" description="Sample Time Compare 1 Register">
        <bitfield id="VAL" description="Specifies the number of sample clocks.
When VAL = 0 or 1, number of sample clocks = Sample clock divide value.
When VAL &gt; 1, number of sample clocks = VAL x Sample clock divide value.
Note: Sample clock divide value is not the value written to SCLKDIV but the actual divide value (SCLKDIV = 2 implies divide value is 4).
Example: VAL = 4, SCLKDIV = 3 implies 32 sample clock cycles." begin="9" end="0" width="10" rwaccess="R/W">
        </bitfield>
    </register>
    <register id="ADC0_WCLOW" width="32" offset="0x1148" description="Window Comparator Low Threshold Register">
        <bitfield id="DATA" description="If DF = 0, unsigned binary format has to be used. 
The value based on the resolution has to be right aligned with the MSB on the left.
For 10-bits and 8-bits resolution, unused bits have to be 0s.

If DF = 1, 2s-complement format has to be used.
The value based on the resolution has to be left aligned with the LSB on the right. 
For 10-bits and 8-bits resolution, unused bits have to be 0s." begin="15" end="0" width="16" rwaccess="R/W">
        </bitfield>
    </register>
    <register id="ADC0_WCHIGH" width="32" offset="0x1150" description="Window Comparator High Threshold Register">
        <bitfield id="DATA" description="If DF = 0, unsigned binary format has to be used.
The threshold value has to be right aligned, with the MSB on the left.
For 10-bits and 8-bits resolution, unused bit have to be 0s.

If DF = 1, 2s-complement format has to be used.
The value based on the resolution has to be left aligned with the LSB on the right. 
For 10-bits and 8-bits resolution, unused bit have to be 0s." begin="15" end="0" width="16" rwaccess="R/W">
        </bitfield>
    </register>
    <register id="ADC0_MEMCTL" width="32" offset="0x1180" instances="4" instaddr="0x4" description="Conversion Memory Control Register">
        <bitfield id="CHANSEL" description="Input channel select." begin="4" end="0" width="5" rwaccess="R/W">
            <bitenum id="CHAN_0" value="0x0" description="Selects channel 0"/>
            <bitenum id="CHAN_1" value="0x1" description="Selects channel 1"/>
            <bitenum id="CHAN_2" value="0x2" description="Selects channel 2"/>
            <bitenum id="CHAN_3" value="0x3" description="Selects channel 3"/>
            <bitenum id="CHAN_4" value="0x4" description="Selects channel 4"/>
            <bitenum id="CHAN_5" value="0x5" description="Selects channel 5"/>
            <bitenum id="CHAN_6" value="0x6" description="Selects channel 6"/>
            <bitenum id="CHAN_7" value="0x7" description="Selects channel 7"/>
            <bitenum id="CHAN_8" value="0x8" description="Selects channel 8"/>
            <bitenum id="CHAN_9" value="0x9" description="Selects channel 9"/>
            <bitenum id="CHAN_10" value="0xA" description="Selects channel 10"/>
            <bitenum id="CHAN_11" value="0xB" description="Selects channel 11"/>
            <bitenum id="CHAN_12" value="0xC" description="Selects channel 12"/>
            <bitenum id="CHAN_13" value="0xD" description="Selects channel 13"/>
            <bitenum id="CHAN_14" value="0xE" description="Selects channel 14"/>
            <bitenum id="CHAN_15" value="0xF" description="Selects channel 15"/>
            <bitenum id="CHAN_16" value="0x10" description="Selects channel 16"/>
            <bitenum id="CHAN_17" value="0x11" description="Selects channel 17"/>
            <bitenum id="CHAN_18" value="0x12" description="Selects channel 18"/>
            <bitenum id="CHAN_19" value="0x13" description="Selects channel 19"/>
            <bitenum id="CHAN_20" value="0x14" description="Selects channel 20"/>
            <bitenum id="CHAN_21" value="0x15" description="Selects channel 21"/>
            <bitenum id="CHAN_22" value="0x16" description="Selects channel 22"/>
            <bitenum id="CHAN_23" value="0x17" description="Selects channel 23"/>
            <bitenum id="CHAN_24" value="0x18" description="Selects channel 24"/>
            <bitenum id="CHAN_25" value="0x19" description="Selects channel 25"/>
            <bitenum id="CHAN_26" value="0x1A" description="Selects channel 26"/>
            <bitenum id="CHAN_27" value="0x1B" description="Selects channel 27"/>
            <bitenum id="CHAN_28" value="0x1C" description="Selects channel 28"/>
            <bitenum id="CHAN_29" value="0x1D" description="Selects channel 29"/>
            <bitenum id="CHAN_30" value="0x1E" description="Selects channel 30"/>
            <bitenum id="CHAN_31" value="0x1F" description="Selects channel 31"/>
        </bitfield>
        <bitfield id="TRIG" description="Trigger policy. Indicates if a trigger will be needed to step to the next MEMCTL in the sequence or to perform next conversion in the case of repeat single channel conversions." begin="24" end="24" width="1" rwaccess="R/W">
            <bitenum id="AUTO_NEXT" value="0x0" description="Next conversion is automatic"/>
            <bitenum id="TRIGGER_NEXT" value="0x1" description="Next conversion requires a trigger"/>
        </bitfield>
        <bitfield id="VRSEL" description="Voltage reference selection. VEREFM must be connected to on-board ground when external reference option is selected.
Note: Writing value 0x3 defaults to INTREF." begin="10" end="8" width="3" rwaccess="R/W">
            <bitenum id="VDDA_VSSA" value="0x0" description="VDDA reference"/>
            <bitenum id="EXTREF_VREFM" value="0x1" description="External reference from pin"/>
            <bitenum id="INTREF_VSSA" value="0x2" description="Internal reference"/>
            <bitenum id="VDDA_VREFM" value="0x3" description="VDDA and VREFM connected to VREF+ and VREF- of ADC"/>
            <bitenum id="INTREF_VREFM" value="0x4" description="INTREF and VREFM connected to VREF+ and VREF- of ADC"/>
        </bitfield>
        <bitfield id="WINCOMP" description="Enable window comparator." begin="28" end="28" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="Disable"/>
            <bitenum id="ENABLE" value="0x1" description="Enable"/>
        </bitfield>
        <bitfield id="BCSEN" description="Enable burn out current source." begin="20" end="20" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="Disable"/>
            <bitenum id="ENABLE" value="0x1" description="Enable"/>
        </bitfield>
        <bitfield id="AVGEN" description="Enable hardware averaging." begin="16" end="16" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="Averaging disabled."/>
            <bitenum id="ENABLE" value="0x1" description="Averaging enabled."/>
        </bitfield>
        <bitfield id="STIME" description="Selects the source of sample timer period between SCOMP0 and SCOMP1." begin="12" end="12" width="1" rwaccess="R/W">
            <bitenum id="SEL_SCOMP0" value="0x0" description="Select SCOMP0"/>
            <bitenum id="SEL_SCOMP1" value="0x1" description="Select SCOMP1"/>
        </bitfield>
    </register>
    <register id="ADC0_STATUS" width="32" offset="0x1340" description="Status Register">
        <bitfield id="BUSY" description="Busy. This bit indicates that an active ADC sample or conversion operation is in progress." begin="0" end="0" width="1" rwaccess="R">
            <bitenum id="IDLE" value="0x0" description="No ADC sampling or conversion in progress."/>
            <bitenum id="ACTIVE" value="0x1" description="ADC sampling or conversion is in progress."/>
        </bitfield>
        <bitfield id="REFBUFRDY" description="Indicates reference buffer is powered up and ready." begin="1" end="1" width="1" rwaccess="R/W">
            <bitenum id="NOTREADY" value="0x0" description="Not ready"/>
            <bitenum id="READY" value="0x1" description="Ready"/>
        </bitfield>
    </register>
    <register id="ADC0_SVT_FIFODATA" width="32" offset="0x556160" description="FIFO Data Register">
    </register>
    <register id="ADC0_SVT_MEMRES" width="32" offset="0x556280" instances="4" instaddr="0x4" description="Memory Result Register">
        <bitfield id="DATA" description="MEMRES result register.
If DF = 0, unsigned binary:
The conversion results are right aligned. In 10 and 8 bit modes, the unused MSB bits are forced to 0. 
If DF = 1, 2s-complement format:
The conversion results are left aligned. In 10 and 8 bit modes, the unused LSB bits are forced to 0.
The data is stored in the right-justified format and is converted to the left-justified 2s-complement format during read back." begin="15" end="0" width="16" rwaccess="R/W">
        </bitfield>
    </register>

</module>